In [1]:
import sys, os
print("Python:", sys.executable)
import pandas as pd
print("pandas:", pd.__version__)

# garantir que o notebook encontra o m√≥dulo 'src'
import os, sys
sys.path.append(os.path.abspath(".."))

Python: c:\Users\sarac\rep_DSF\BigDataFoundations\.venv\Scripts\python.exe
pandas: 2.3.3

In [2]:
from src.utils import get_athena_connection, read_sql_df
from src.config import DB_ATHENA

conn = get_athena_connection()

# show Athena tables
sql = f"SHOW TABLES IN {DB_ATHENA};"
tables = read_sql_df(sql, conn)
tables

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

          tab_name
0            links
1    links_parquet
2           movies
3   movies_parquet
4          ratings
5  ratings_parquet
6             tags
7     tags_parquet

In [3]:
##teste

df_test = read_sql_df("SELECT * FROM movies_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

,movieid,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
df_test = read_sql_df("SELECT * FROM ratings_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   userid  movieid  rating           timestamp
0  176974      141     3.0 1997-05-25 16:09:46
1  176974      145     3.0 1997-02-26 16:07:57
2  176974      150     3.0 1997-06-17 13:49:27
3  176974      151     3.0 1997-02-26 15:49:11
4  176974      153     3.0 1997-06-17 13:55:33

In [5]:
df_test = read_sql_df("SELECT * FROM tags_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   userid  movieid                tag           timestamp
0   78213    50954             school 2018-06-07 05:42:37
1   78213    50954  soul transference 2018-06-07 05:42:37
2   78213    50954              spell 2018-06-07 05:42:37
3   78213    50954        teen comedy 2018-06-07 05:42:37
4   78213    50954           teenager 2018-06-07 05:42:37

In [6]:
df_test = read_sql_df("SELECT * FROM links_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   movieid   imdbid  tmdbid
0    91548  1687247   66150
1    91554  0154467  278822
2    91556  0348572   54157
3    91558  0113077   26824
4    91560  1706596   73448